# 第二章

In [2]:
import numpy as np
import pandas as pd

# 载入data文件中的:result.csv
text = pd.read_csv(r'data\result.csv')
text.head()

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,NaN,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,8.0500,NaN,S

# 数据聚合与分组操作

## 数据运用

### 任务一：Group By 机制

对**数据集**进行分类，并在每一组上应用一个聚合函数或转换函数，这通常是数据分析工作流中的一个重要部分。在载入、合并、准备数据集之后，你可能需要计算分组统计或者数据透视表用于报告或可视化的目的。pandas 提供一个了灵活的group by 结构，允许你以一种自然的的方式对数据集进行切片、切开和总结。

我们知道描述组操作的术语**拆分-应用-联合**。步骤如下：

- 数据包含在 pandas 对象中，可以是 Series 对象、DataFrame 或者其它数据结构
- 根据提供的一个或者多个键分离到各个组中
- 分离操作时在数据对象的特定轴上进行的。一般 行方向（axis=0），列方向（axis=1）

In [6]:
# groupby 的使用，举例如下：
import pandas as pd
import numpy as np

df = pd.DataFrame({
                    'key1' : ['a', 'a', 'b', 'b', 'a'],
                    'key2' : ['one', 'two', 'one', 'two', 'one'],
                    'data1': np.random.rand(5),
                    'data2': np.random.rand(5)
                  })
df

  key1 key2     data1     data2
0    a  one  0.708630  0.301915
1    a  two  0.883650  0.168599
2    b  one  0.639999  0.445437
3    b  two  0.900632  0.192605
4    a  one  0.991335  0.296236

In [11]:
grouped = df['data1'].groupby(df['key1'])     # 对 df['data1'] Series数据，根据 列 df['key1'] 进行分组
grouped  # 它是 SeriesGroupBy object 对象

In [13]:
grouped.mean()  # 根据 df['key1'] 分组之后的平均值。

key1
a    0.861205
b    0.770315
Name: data1, dtype: float64

In [15]:
grouped.size() # key1 中，每个类别含有的个数。

key1
a    3
b    2
Name: data1, dtype: int64

我们也可以向SQL语言那样，group by 列名1, 列名2， 根据多列进行分组：

In [22]:
grouped = df['data1'].groupby([df['key1'], df['key2']])           # 根据多列分组，使用列表 [] 
print(grouped)
grouped.mean()

<pandas.core.groupby.generic.SeriesGroupBy object at 0x000001F972B2AEB0>

key1  key2
a     one     0.849982
      two     0.883650
b     one     0.639999
      two     0.900632
Name: data1, dtype: float64

观察结果，得到的结果是**多层索引**的数据, 我们可以把它转化成普通的 DataFrame 对象：

In [23]:
grouped.mean().unstack()

key2       one       two
key1
a     0.849982  0.883650
b     0.639999  0.900632

以上例子，分组键都是 Series 对象，分组键也可以是正确长度的任何数组：

In [30]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
print(states)
years = np.array([2005, 2005, 2006, 2005, 2006])
print(years)
df['data1'].groupby([states, years]).mean()

['Ohio' 'California' 'California' 'Ohio' 'Ohio']
[2005 2005 2006 2005 2006]

California  2005    0.883650
            2006    0.639999
Ohio        2005    0.804631
            2006    0.991335
Name: data1, dtype: float64

分组信息作为你想要继续处理的数据，通常包含在同一个 DataFrame 信息中，传递数组不常用。在这种情况下，我们可以直接传递**列名**作为分组件：

In [31]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.861205  0.255583
b     0.770315  0.319021

In [32]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one   0.849982  0.299075
     two   0.883650  0.168599
b    one   0.639999  0.445437
     two   0.900632  0.192605

通用的 GroupBy 方法是 size， size 方法返回一个包含组大小信息的 Series：

In [33]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

注意：分组键中的任何确实值将被排除在结果之外。

#### 遍历各数组

GroupBy 对象支持 **迭代**，会生成包含*组名*和*数据块*的2维元组序列。如下：

In [39]:
for name, group in df.groupby('key1'):
    print(name)       # 组名
    print(group)      # 数据块

a
  key1 key2     data1     data2
0    a  one  0.708630  0.301915
1    a  two  0.883650  0.168599
4    a  one  0.991335  0.296236
b
  key1 key2     data1     data2
2    b  one  0.639999  0.445437
3    b  two  0.900632  0.192605

在*多个分组键*的情况下，元组中的第一个元素是键值的元组：

In [40]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one  0.708630  0.301915
4    a  one  0.991335  0.296236
('a', 'two')
  key1 key2    data1     data2
1    a  two  0.88365  0.168599
('b', 'one')
  key1 key2     data1     data2
2    b  one  0.639999  0.445437
('b', 'two')
  key1 key2     data1     data2
3    b  two  0.900632  0.192605

In [47]:
pieces = dict(list(df.groupby('key1')))  # [( , ), ( , )] ==> { : ,  : }
print(pieces)
pieces['b']

{'a':   key1 key2     data1     data2
0    a  one  0.708630  0.301915
1    a  two  0.883650  0.168599
4    a  one  0.991335  0.296236, 'b':   key1 key2     data1     data2
2    b  one  0.639999  0.445437
3    b  two  0.900632  0.192605}

  key1 key2     data1     data2
2    b  one  0.639999  0.445437
3    b  two  0.900632  0.192605

In [48]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

默认情况下，groupby 在axis=0的轴向上分组，但你也可以在其他任意轴上进行分组。

In [52]:
grouped = df.groupby(df.dtypes, axis=1) # 在列上进行分组

for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0  0.708630  0.301915
1  0.883650  0.168599
2  0.639999  0.445437
3  0.900632  0.192605
4  0.991335  0.296236
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

#### 选择一列或所有列的子集

将从 DataFrame 创建的 GroupBy 对象用列名称或列名称数组进行索引时，会产生用于聚集的列子集的效果。这表明：

In [57]:
grouped = df.groupby('key1')['data1']
grouped.mean()

key1
a    0.861205
b    0.770315
Name: data1, dtype: float64

In [60]:
grouped = df.groupby('key1')[['data2']]
grouped.mean()

         data2
key1
a     0.255583
b     0.319021

等价于：

In [61]:
df['data1'].groupby(df['key1'])
df['data2'].groupby(df['key1'])

由于是对于大型数据集，可能只需要聚合少部分列。例如：计算 data2 列的均值，并获得DataFrame形式的结果，如下：

In [67]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one   0.299075
     two   0.168599
b    one   0.445437
     two   0.192605

如果传递的是列表或者数组，则此索引操作返回的对象是分组的 DataFrame； 如果只有 单个列名作为标量传递，则返回的是 Series。

In [68]:
s_grouped = df.groupby(['key1', 'key2'])['data2']
s_grouped

In [69]:
s_grouped.mean()

key1  key2
a     one     0.299075
      two     0.168599
b     one     0.445437
      two     0.192605
Name: data2, dtype: float64

#### 使用字典和Series分组

In [72]:
# index : 行索引; columns : 列索引
people = pd.DataFrame(
                        np.random.randn(5, 5),
                        columns=['a', 'b', 'c', 'd', 'e'],
                        index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis']
                     )
people

               a         b         c         d         e
Joe    -1.609579 -1.192621 -0.163857 -0.429888 -2.526648
Steve  -1.046914  1.324459  0.025683  1.063090 -0.363446
Wes     0.221673 -0.759122  1.065586 -2.526820 -0.219010
Jim    -1.253080  0.971543 -1.323438  0.484192 -0.456703
Travis  1.601501 -1.100026  1.614691 -0.179980  1.027023

In [75]:
people.iloc[2:3, [1, 2]] = np.nan # add a few NA values
people

               a         b         c         d         e
Joe    -1.609579 -1.192621 -0.163857 -0.429888 -2.526648
Steve  -1.046914  1.324459  0.025683  1.063090 -0.363446
Wes     0.221673       NaN       NaN -2.526820 -0.219010
Jim    -1.253080  0.971543 -1.323438  0.484192 -0.456703
Travis  1.601501 -1.100026  1.614691 -0.179980  1.027023

假设我们知道各个列的映射关系，然后根据这个字典构造，传给 groupby 的数组。

In [76]:
mapping = {
    'a' : 'red',
    'b' : 'red',
    'c' : 'blue',
    'd' : 'blue',
    'e' : 'red',
    'f' : 'orange'
}
mapping

{'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f': 'orange'}

In [78]:
by_columns = people.groupby(mapping, axis=1)   # 根据字典 mapping 的映射结果，按照列进行排序，然后分组的结果相加
by_columns.sum()

            blue       red
Joe    -0.593745 -5.328848
Steve   1.088773 -0.085900
Wes    -2.526820  0.002663
Jim    -0.839246 -0.738239
Travis  1.434712  1.528498

也可以把 Series 对象，作为分组的依据。

In [79]:
map_series = pd.Series(mapping)
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [82]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

#### 使用函数分组

In [84]:
people

               a         b         c         d         e
Joe    -1.609579 -1.192621 -0.163857 -0.429888 -2.526648
Steve  -1.046914  1.324459  0.025683  1.063090 -0.363446
Wes     0.221673       NaN       NaN -2.526820 -0.219010
Jim    -1.253080  0.971543 -1.323438  0.484192 -0.456703
Travis  1.601501 -1.100026  1.614691 -0.179980  1.027023

In [106]:
for i in people.index:
    print(len(i))

3
5
3
3
6

In [107]:
people.groupby(len).sum()  # 根据索引字符串的长度进行分组，新索引是 函数返回的字符串的长度

          a         b         c         d         e
3 -2.640987 -0.221078 -1.487295 -2.472517 -3.202360
5 -1.046914  1.324459  0.025683  1.063090 -0.363446
6  1.601501 -1.100026  1.614691 -0.179980  1.027023

In [109]:
key_list = ['one', 'one', 'one', 'two', 'two']
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -1.609579 -1.192621 -0.163857 -2.526820 -2.526648
  two -1.253080  0.971543 -1.323438  0.484192 -0.456703
5 one -1.046914  1.324459  0.025683  1.063090 -0.363446
6 two  1.601501 -1.100026  1.614691 -0.179980  1.027023

### 任务二：计算泰坦尼克号男性与女性的平均票价

In [116]:
df = pd.read_csv(r'data\result.csv')
df.head()

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,NaN,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,8.0500,NaN,S

In [122]:
df['Fare'].groupby(df['Sex']).mean()

Sex
female    44.479818
male      25.523893
Name: Fare, dtype: float64

In [119]:
df.groupby('Sex')[['Fare']].mean()

             Fare
Sex
female  44.479818
male    25.523893

In [131]:
# 可以使用 agg()，把函数名以 '字符串' 形式传递：
df.groupby('Sex').agg({'Fare' : 'mean'})

             Fare
Sex
female  44.479818
male    25.523893

### 任务三：统计泰坦尼克号中男女的存活人数

In [124]:
df.groupby('Sex')[['Survived']].sum()

        Survived
Sex
female       233
male         109

### 任务四：计算客舱不同等级的存活人数

In [126]:
# pclass : 表示 几等座
df.groupby('Pclass')[['Survived']].sum()

        Survived
Pclass
1            136
2             87
3            119

从数据分析角度，我们可以看出，女性购买的平均票价大于男性，男性幸存人数多余男性，1等仓幸存人数最多。

In [136]:
# 任务二、任务三可以使用 agg() 函数同时计算：
# rename() 是给列重命名
df.groupby('Sex').agg({'Fare' : 'mean', 'Survived' : 'sum'}).rename(columns={'Fare' : 'mean_fare', 'Survived' : 'sum_survived'})

        mean_fare  sum_survived
Sex
female  44.479818           233
male    25.523893           109

### 任务五：统计在不同等级的票中的不同年龄的船票花费的平均值

In [139]:
df.groupby(['Pclass', 'Age'])[['Fare']].mean()

                  Fare
Pclass Age
1      0.92   151.5500
       2.00   151.5500
       4.00    81.8583
       11.00  120.0000
       14.00  120.0000
...                ...
3      61.00    6.2375
       63.00    9.5875
       65.00    7.7500
       70.50    7.7500
       74.00    7.7750

[182 rows x 1 columns]

### 任务六：将任务二和任务三的数据合并，并保存到sex_fare_survived.csv

In [142]:
mean_fare = df.groupby('Sex')[['Fare']].mean()
sum_survived = df.groupby('Sex')[['Survived']].sum()
mean_fare

             Fare
Sex
female  44.479818
male    25.523893

In [143]:
sum_survived

        Survived
Sex
female       233
male         109

In [145]:
pd.merge(mean_fare, sum_survived, on='Sex').to_csv(r'data\train.csv', index=None)

### 任务七：得出不同年龄的总的存活人数，然后找出存活人数最多的年龄段，最后计算存活人数最高的存活率（存活人数/总人数）

In [156]:
age_survived = df.groupby('Age')[['Survived']].sum()
age_survived

       Survived
Age
0.42          1
0.67          1
0.75          2
0.83          2
0.92          1
...         ...
70.00         0
70.50         0
71.00         0
74.00         0
80.00         1

[88 rows x 1 columns]

In [188]:
age_survived['Survived'].values

array([ 1,  1,  2,  2,  1,  5,  3,  5,  7,  4,  2,  1,  2,  2,  0,  1,  1,
        2,  3,  0,  4,  6,  6,  9,  9,  3,  0,  5, 11,  5,  0, 15,  0,  6,
        6, 11,  7,  0,  8, 10,  0,  8,  9,  1,  6,  6,  0, 11, 11,  0,  1,
        5,  5,  6,  0,  2,  6,  1,  3,  5,  0,  0,  1,  6,  4,  5,  2,  3,
        1,  3,  1,  0,  2,  0,  3,  0,  2,  0,  2,  2,  0,  0,  0,  0,  0,
        0,  0,  1], dtype=int64)

In [192]:
age_survived.max()

(1,)

In [190]:
age_survived['Survived'].values == age_survived.max()

array([ 1,  1,  2,  2,  1,  5,  3,  5,  7,  4,  2,  1,  2,  2,  0,  1,  1,
        2,  3,  0,  4,  6,  6,  9,  9,  3,  0,  5, 11,  5,  0, 15,  0,  6,
        6, 11,  7,  0,  8, 10,  0,  8,  9,  1,  6,  6,  0, 11, 11,  0,  1,
        5,  5,  6,  0,  2,  6,  1,  3,  5,  0,  0,  1,  6,  4,  5,  2,  3,
        1,  3,  1,  0,  2,  0,  3,  0,  2,  0,  2,  2,  0,  0,  0,  0,  0,
        0,  0,  1], dtype=int64)

In [177]:
# 找出最大值的年龄段
age_survived.max() # 存货人数最大的
age_survived[age_survived.values == age_survived.max()]

<ipython-input-177-6d5823973a15>:3: DeprecationWarning: elementwise comparison failed; this will raise an error in the future.
  age_survived[age_survived.values == age_survived.max()]

ValueError: ('Lengths must match to compare', (1,), (88, 1))